import React from "react";
import "./PlacesInMacca.css";

const PlacesInMacca = () => {
  return (
    <div className="PlacesInMacca">
      <div className="placemacca">
        <div className="fixed"></div>
        <h2 class="titel">أماكن الزيارة في مكة المكرمة</h2>
        <div class="line"></div>
        <div class="macc-plac">
          <div class="box box4">
            <div class="contnt">
            <p>
              <span>غار حراء</span> هو الغار الذي كان يختلي فيه رسول الله محمد ﷺ، قبل البعثة
              ونزل جبريل بالقرآن عليه، وهو المكان الذي نزل الوحي فيه لأول مرة
              على النبي وغار حراء يقع في شرق مكة المكرمة على يسار الذاهب إلى
              عرفات في أعلى «جبل النور» أو «جبل الإسلام»، على ارتفاع 634 متراً،
              ولايتسع إلا لأربعة أو خمسة أشخاص فقط يبعد مسافة 4 كم عن المسجد
              الحرام
            </p>
            </div>
          </div>
          <div class="box box5">
          <div class="contnt">
            <p>
              
              <span>مسجد نَمِرَة</span> هو مسجد وواحد من أهم المعالم في مشعر عرفات، وبه يصلي
              عشرات الآلاف من ضيوف الرحمن (حجاج البيت الحرام) صلاة الظهر وصلاة
               العصر في يوم عرفة جمعا وقصرا اقتداء بالنبي محمد ﷺ
            </p>
            </div>
          </div>
          <div class="box box6">
          <div class="contnt">
            <p>
              <span>مسجد التنعيم</span>  مسجد التنعيم أو مسجد السيدة عائشة أحد مساجد مكة المكرمة، يقع في
              الجزء الغربي من مكة المكرمة على مسافة 7 كم عن الحرم المكي الشريف،
              ومنه يحرم أهالي مكة بالعمرة اكتسب شهرته من كونه بُني في الموضع
              الذي أحرمت منه أم المؤمنين عائشة بنت أبي بكر بالعمرة في حجة الوداع
              سنة 9 للهجرة
            </p>
            </div>
          </div>
        </div>
        <div class="macc-plac">
          
          <div class="box box1">
          <div class="contnt">
            <p>
              <span>مسجد الجن </span>
              ما هي قصة مسجد الجن في مكه؟  قيل إن النبي  ﷺ 
              عندما كان قادمًا من الطائف الى مكة ذات ليلة، نزل
              في وادي نخلة، وهو واد ما بين البلدين، وفي الظلام الدامس، وليس معه
              رفيق غير الله سبحانه وتعالى توضأ وقام يصلي، ورفع صوته بالقرآن،
              يستأنس به في وحشته وفي سفره فسمعه الجن واسلم قسم منهم ، ف سمي المسجد بهذا الاسم
            </p>
            </div>
          </div>
          <div class="box box2">
          <div class="contnt">
            <p>
              <span> مسجد الخيف </span> أحد مساجد مكة المكرمة
              وسمي الخيف نسبة إلى خيف بني كنانة في سفح جبل منى الجنوبي بالقرب من
              الجمرة الصغرى، والخيف لغة هو ما انحدر عن غلظ الجبل وارتفع عن مسيل
              الماء ، وتوجد فيه بصفة دائمة أعداد كبيرة من الحجاج في موسم الحج
              ومن فضل المسجد فقد روى الطبراني عن ابن عباس أنه قال : <br />
              « صلى في مسجد الخيف سبعون نبيا » <br />
            
            </p>
            </div>
          </div>
          <div class="box box3">
          <div class="contnt">
            <p>
              <span>جبل النور</span>
          من أهم الأماكن في تاريخ الإسلام وسيرة نبيه محمد صلى الله
              عليه وسلم؛ يقع شمال شرقي المسجد الحرام بمسافة أربعة كيلو مترات
              وفي أعلى قمة الجبل من الناحية الجنوبية الغربية يقع غار حراء الذي
              كان النبي صلى الله عليه وسلم يخلو فيه بنفسه ليتعبد قبل البعثة؛
              وفيه نزل عليه الوحي
            </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default PlacesInMacca;
